app/views/player_characters/_create_form.html.erb

SELECT "player_character_classes".* FROM "player_character_classes"
---

           <%= f.collection_select :classDnD, PlayerCharacterClass.all, :id, :name, {:include_blank => "Select a Class"},{:class => "form-control",:onChange=>"classSelectionHandler();"} %>

SELECT "races".* FROM "races"
---
          <%= f.label :race %><br>
          <%= f.collection_select :race, Race.all, :id, :name, {:include_blank => "Select a race"},{:class => "form-control",:onChange=>"raceSelectionHandler();"} %>