app/views/player_characters/show.html.erb

        <h4>Ability Scores </h4>
          <% @player_character.ability_scores.each do |abilityScore| %>
---
SELECT "ability_scores".* FROM "ability_scores" WHERE "ability_scores"."playercharacter_id" = ?  [["playercharacter_id", 980190962]]

        <ul class="list-group">
        <% @player_character.skills.each do |skill| %>
---
SELECT "skills".* FROM "skills" WHERE "skills"."playercharacter_id" = ?  [["playercharacter_id", 980190962]]

          <ul class="list-group">
          <% @player_character.saving_throws.each do |savingThrow| %>
---
SELECT "saving_throws".* FROM "saving_throws" WHERE "saving_throws"."playercharacter_id" = ?  [["playercharacter_id", 980190962]]

          <tbody>
          <% @player_character.attack_weapons.each do |attackWeapon| %>
---
SELECT "attack_weapons".* FROM "attack_weapons" WHERE "attack_weapons"."playercharacter_id" = ?  [["playercharacter_id", 980190962]]

          <tbody>
            <% @player_character.armor_and_shields.each do |armorAndShields| %>
---
SELECT "armor_and_shields".* FROM "armor_and_shields" WHERE "armor_and_shields"."playercharacter_id" = ?  [["playercharacter_id", 980190962]]

        <h4>Allies And Organizations</h4>
        <% @player_character.allies_and_organizations.each do |alliesAndOrganizations| %>
---
SELECT "allies_and_organizations".* FROM "allies_and_organizations" WHERE "allies_and_organizations"."playercharacter_id" = ?  [["playercharacter_id", 980190962]]