app/controllers/player_characters_controller.rb

  def show

    @player_character = PlayerCharacter.find(params[:id])
---
SELECT  "player_characters".* FROM "player_characters" WHERE "player_characters"."id" = ? LIMIT 1  [["id", 980190962]]

  def create
    @player_character = current_user.player_characters.new(player_character_params);

    @player_character.race = Race.find(params[:player_character][:race]).name if Race.exists? (params[:player_character][:race])
    @player_character.classDnD = PlayerCharacterClass.find(params[:player_character][:classDnD]).name if PlayerCharacterClass.exists? (params[:player_character][:classDnD])
---
SELECT "races".* FROM "races" WHERE "races"."id" = ?  [["id", 0]]
SELECT "player_character_classes".* FROM "player_character_classes" WHERE "player_character_classes"."id" = ?  [["id", 0]]

    else
      # normal create function
      respond_to do |format|
        if @player_character.save
          @hideTable = HideAttributesTable.new(pc_id:@player_character.id , ability_reveal: true, skill_reveal:true, savingthrow_reveal:true, personality_reveal:true, attribute_reveal:true, characterbonus_reveal:true, wealth_reveal:true, physicalfeature_reveal:true, carry_reveal:true, spellcast_reveal:true, attackweapon_reveal:true, spell_reveal:true, armorshield_reveal:true, attackdescription_reveal:true, equipment_reveal:true, characterdescription_reveal:true, alliesandorganisation_reveal:true, additionalfeature_reveal:true, treasure_reveal:true);
          @hideTable.save
---
INSERT INTO "player_characters" ("isUsed", "name", "classDnD", "level", "background", "race", "alignment", "experiencePoints", "inspiration", "proficiencyBonus", "armorClass", "initiative", "speed", "currentHitPoints", "maxHitPoints", "temporaryHitPoints", "totalHitDice", "hitDice", "deathSaveSuccesses", "deathSaveFailures", "personalityTraits", "ideals", "bonds", "flaws", "attacksDescription", "passiveWisdom", "otherProficienciesAndLanguages", "maxEquipmentCarryCapacity", "currentEquipmentCarryCapacity", "featuresAndTraits", "age", "height", "weight", "eyes", "skin", "hair", "characterAppearance", "characterBackstory", "additionalFeaturesAndTraits", "treasure", "spellCastingAbility", "spellSaveDC", "spellAttackBonus", "creator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "hide_attributes_tables" ("pc_id", "ability_reveal", "skill_reveal", "savingthrow_reveal", "personality_reveal", "attribute_reveal", "characterbonus_reveal", "wealth_reveal", "physicalfeature_reveal", "carry_reveal", "spellcast_reveal", "attackweapon_reveal", "spell_reveal", "armorshield_reveal", "attackdescription_reveal", "equipment_reveal", "characterdescription_reveal", "alliesandorganisation_reveal", "additionalfeature_reveal", "treasure_reveal", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    # if user want to add/remove wweapons or shields
    @player_character = PlayerCharacter.find(params[:id])
---
SELECT  "player_characters".* FROM "player_characters" WHERE "player_characters"."id" = ? LIMIT 1  [["id", 980190962]]

  def destroy
    @hide_attributes_table = HideAttributesTable.find_by pc_id: @player_character.id
    @hide_attributes_table.destroy unless @hide_attributes_table.nil?
---
SELECT  "hide_attributes_tables".* FROM "hide_attributes_tables" WHERE "hide_attributes_tables"."pc_id" = ? LIMIT 1  [["pc_id", 980190962]]
DELETE FROM "player_characters" WHERE "player_characters"."id" = ?  [["id", 980190962]]

    def set_player_character
      @player_character = PlayerCharacter.find(params[:id])
---
SELECT  "player_characters".* FROM "player_characters" WHERE "player_characters"."id" = ? LIMIT 1  [["id", 980190962]]